In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
pd.Series([1,3,5,6,8])

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [4]:
df=pd.DataFrame(data=np.arange(1,49).reshape(12,4), columns=['X1','X2','X3','X4'])
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int32
 1   X2      12 non-null     int32
 2   X3      12 non-null     int32
 3   X4      12 non-null     int32
dtypes: int32(4)
memory usage: 320.0 bytes

In [6]:
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [8]:
df.sort_values(by="X2", ascending=False)

    X1  X2  X3  X4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

### 판다스로 데이터가지고 놀기

In [9]:
df["X1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: X1, dtype: int32

In [10]:
df.loc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int32

In [11]:
df.loc[0][2]

3

In [12]:
df.loc[0]["X3"]

3

In [16]:
# df.loc에 2차원 indexing도 가능하다.
# df.loc["row에 대한 조건", "col에 대한 조건"]

df.loc[4,"X2"]
df.loc[[0,3],["X1","X3"]]
df.loc[0:4, "X1":"X3"]

   X1  X2  X3
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15
4  17  18  19

In [21]:
mask = df["X1"] > 10  # row에 대한 조건
df.loc[mask]

df.loc[df["X2"] >= 20]

df.loc[df["X2"] >= 20, "X4"]

5     24
6     28
7     32
8     36
9     40
10    44
11    48
Name: X4, dtype: int32

In [25]:
df.loc[(df["X3"] >= 10) & (df["X3"] <= 30)]

   X1  X2  X3  X4
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24
6  25  26  27  28

In [26]:
df.loc[(30 < df["X2"]) | (10 > df["X2"])]

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [29]:
# row 8번째 까지, column 2번째 까지
df.iloc[3:8, 0:2]

   X1  X2
3  13  14
4  17  18
5  21  22
6  25  26
7  29  30

### 실제 데이터로 사용해보기
#### 데이터 사이트 : https://www.kaggle.com/c/titanic/data

In [3]:
titanic = pd.read_csv("./data/titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic.loc[titanic["Age"] >= 30, "Name"]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
6                                McCarthy, Mr. Timothy J
11                              Bonnell, Miss. Elizabeth
                             ...
873                          Vander Cruyssen, Mr. Victor
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
881                                   Markun, Mr. Johann
885                 Rice, Mrs. William (Margaret Norton)
890                                  Dooley, Mr. Patrick
Name: Name, Length: 330, dtype: object

In [7]:
pd.pivot_table(data = titanic, index = "Sex", values = "Survived") # mean

        Survived
Sex
female  0.742038
male    0.188908

In [9]:
# 평균, 합계, 수 함께 보기
pd.pivot_table(data=titanic, index="Sex", values="Survived", aggfunc=["mean","sum","count"])

# 유의미하게 여성들이 많이 살아남았다.

            mean      sum    count
        Survived Survived Survived
Sex
female  0.742038      233      314
male    0.188908      109      577

In [13]:
pd.pivot_table(data=titanic, index=["Pclass","Sex"], values="Survived", aggfunc=["count","sum","mean"])

                 count      sum      mean
              Survived Survived  Survived
Pclass Sex
1      female       94       91  0.968085
       male        122       45  0.368852
2      female       76       70  0.921053
       male        108       17  0.157407
3      female      144       72  0.500000
       male        347       47  0.135447

### 엑셀 데이터 병합하기

In [43]:
from glob import glob
from tqdm.notebook import tqdm
import os

stations_files = glob('./data/Opinet/*.xls')
len(stations_files)

126

In [44]:
tmp = pd.read_excel(stations_files[0], header = 2)
tmp
tmp2=pd.read_excel(stations_files[1], header = 2)
pd.concat([tmp, tmp2])

,지역,상호,주소,상표,전화번호,셀프여부,고급휘발유,휘발유,경유,실내등유
0,서울특별시,재건에너지 재정제2주유소 고속셀프지점,서울특별시 강동구 천호대로 1246 (둔촌제2동),현대오일뱅크,02-487-2030,Y,-,1589,1709,-
1,서울특별시,구천면주유소,서울 강동구 구천면로 357 (암사동),현대오일뱅크,02-441-0536,N,-,1594,1783,-
2,서울특별시,(주)삼표에너지 고덕주유소,서울 강동구 고덕로 39 (암사동),GS칼텍스,02-441-3327,Y,1855,1635,1795,1615
3,서울특별시,현대오일뱅크㈜직영 명일셀프주유소,서울 강동구 고덕로 168 (명일동),현대오일뱅크,02-3428-1739,Y,1933,1644,1798,-
4,서울특별시,방아다리주유소,서울 강동구 동남로 811 (명일동),SK에너지,02-442-5145,Y,-,1645,1875,1700
5,서울특별시,대성석유(주)길동주유소,서울 강동구 천호대로 1168,GS칼텍스,02-474-7222,N,1895,1646,1798,1600
6,서울특별시,(주)소모에너지 신월주유소,서울 강동구 양재대로 1323 (성내동),GS칼텍스,02-6956-6674,Y,1896,1646,1798,1650
7,서울특별시,sk해뜨는주유소,서울 강동구 상일로 132 (강일동),SK에너지,02-442-7801,Y,-,1665,1879,1800
8,서울특별시,(주)퍼스트오일 코알라주유소,서울특별시 강동구 올림픽로 556 (성내동),S-OIL,02-484-1162,Y,-,1678,1888,-
9,서울특별시,지에스칼텍스㈜ 동서울주유소,서울 강동구 천호대로 1456 (상일동),GS칼텍스,02-426-5372,Y,1829,1679,1817,-
10,서울특별시,주)지유에너지직영 오렌지주유소,서울 강동구 성안로 102 (성내동),SK에너지,02-484-6165,N,-,1695,1875,1693
11,서울특별시,(주)소모에너지 성내주유소,서울 강동구 올림픽로 578 (성내동),GS칼텍스,02-479-3838,Y,-,1698,1888,-
12,서울특별시,천호현대주유소,서울 강동구 천중로 67 (천호동),현대오일뱅크,02-484-9323,N,-,1876,1997,-
13,서울특별시,광성주유소,서울 강동구 올림픽로 673 (천호동),S-OIL,02-470-5133,N,-,2028,2078,2000
0,서울특별시,동서울고속주유소,서울 동대문구 한천로 414,SK에너지,02-969-1144,Y,1745,1560,1670,-
1,서울특별시,삼영주유소,서울 동대문구 답십리로 258 (장안동),SK에너지,02-2217-2017,N,-,1565,1725,1700
2,서울특별시,(주)경동주유소,서울 동대문구 이문로 191 (이문동),S-OIL,02-965-6006,Y,-,1565,1735,1600
3,서울특별시,(주)파랑에너지,서울 동대문구 망우로 126,GS칼텍스,02-2242-5145,Y,1775,1565,1725,1530
4,서울특별시,열린주유소,서울 동대문구 한천로 263 (휘경동),S-OIL,02-2215-6543,N,-,1565,1670,-
5,서울특별시,재정주유소,서울 동대문구 전농로 121 (전농동),현대오일뱅크,070-8256-4617,Y,1755,1565,1755,-
6,서울특별시,풍한주유소,서울 동대문구 안암로 168,SK에너지,02-924-5189,N,-,1565,1675,-
7,서울특별시,재정제2주유소,서울 동대문구 사가정로 90 (전농동),현대오일뱅크,02-2249-6682,Y,-,1565,1755,-
8,서울특별시,오동나무주유소,서울 동대문구 한천로 81 (답십리동),S-OIL,02-2247-5132,N,-,1598,1768,1600
9,서울특별시,(주)안국에너지 삼원셀프주유소,서울 동대문구 망우로 90 (휘경동),SK에너지,02-2244-1972,Y,-,1598,1768,1570
10,서울특별시,현대오일뱅크㈜직영 스피드주유소,서울 동대문구 천호대로 453 (장안동),현대오일뱅크,02-2216-5151,N,1919,1598,1749,-
11,서울특별시,삼미상사(주)장안킹셀프주유소,서울 동대문구 한천로 100 (장안동),SK에너지,02-2242-7115,Y,-,1598,1745,-
12,서울특별시,대성산업㈜청량리주유소,서울 동대문구 왕산로 289 (청량리동),GS칼텍스,02-966-9400,Y,-,1599,1735,-
13,서울특별시,홍능주유소,서울 동대문구 홍릉로 87 (청량리동),S-OIL,02-966-9190,N,-,1605,1765,1650
14,서울특별시,대성산업(주)동마장주유소,서울 동대문구 고산자로 405 (용두동),GS칼텍스,02-966-5451,Y,1929,1625,1719,-
15,서울특별시,배봉로주유소,서울 동대문구 서울시립대로 108,현대오일뱅크,02-2242-0556,Y,-,1675,1795,-
16,서울특별시,한영주유소 (한화),서울 동대문구 망우로 38 (휘경동),현대오일뱅크,02-2214-9890,N,-,1790,1890,1690

In [48]:
total = pd.DataFrame()
for file_name in tqdm(stations_files):
        temp = pd.read_excel(file_name, header=2)
        total = pd.concat([total, temp])
        
total = total.sort_values(by="지역")
total = total.reset_index(drop=True)
total

  0%|          | 0/126 [00:00<?, ?it/s]

,지역,상호,주소,상표,전화번호,셀프여부,고급휘발유,휘발유,경유,실내등유
0,강원도,강릉농협 성산주유소,강원 강릉시 성산면 구산길 16,NH-OIL,033-641-9379,N,-,1490,1690,1450
1,강원도,GS교동택지주유소,강원 강릉시 교동하슬라로 233,GS칼텍스,033-647-5145,Y,1868,1634,1828,1500
2,강원도,연곡주유소,강원 강릉시 연곡면 진고개로 2720,S-OIL,033-661-4717,N,-,1600,1800,1500
3,강원도,동국주유소,강원 강릉시 남구길 31,현대오일뱅크,033-641-1234,N,-,1598,1798,1500
4,강원도,무지개주유소,강원 강릉시 강동면 율곡로 2170,GS칼텍스,033-645-4947,N,-,1598,1748,1500
...,...,...,...,...,...,...,...,...,...,...
5216,인천광역시,송림주유소,인천 동구 염전로 71 (송림동),S-OIL,032-773-9698,Y,-,1515,1625,1600
5217,인천광역시,대박주유소,인천 동구 송미로 50 (송림동),알뜰주유소,032-762-3080,N,-,1509,1605,-
5218,인천광역시,서광주유소,인천 남동구 백범로 471,현대오일뱅크,032-434-6113,N,-,1619,-,1550
5219,인천광역시,송현주유소,인천 동구 중봉대로 70 (송현동),현대오일뱅크,032-766-1363,Y,1787,1518,1629,1500
5220,인천광역시,구도일주유소,인천 부평구 경인로 1020,S-OIL,032-514-8072,Y,-,1547,1667,-

In [46]:
total.to_excel("전체주유소_가격.xlsx", index=False)